tools/generators/rivtatools-web/trunk/rivtatools-web/war/WEB-INF/classes/se/skl/rivta/rivtatools_web/generator/RegisterMedicalCertificateInteraction_1.0_rivtabp21.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Fake Org licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
-->
<wsdl:definitions name="RegisterMedicalCertificateInteraction"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:itr="urn:riv:itintegration:registry:1"
	xmlns:tjsr="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1"
	xmlns:tjsi="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateInitiator:1"
	xmlns:tns="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificate:1:rivtabp21"
	targetNamespace="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificate:1:rivtabp21">

	<xs:annotation>
		<xs:documentation>
			 Tjänsteinteraktionens namn: RegisterMedicalCertificateInteraction
			 Beskrivning: 
			   Submission of medical health reports to the Swedish social insurance institutions
			 Revisioner: 
			 Tjänstedomän: insuranceprocess:healthreporting
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP21
			 Förvaltas av: Fake Org
		</xs:documentation>
	</xs:annotation>

	<wsdl:types>
		<xs:schema targetNamespace="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificate:1:rivtabp21">
			<xs:import schemaLocation="RegisterMedicalCertificateResponder_1.0.xsd"
				namespace="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1" />
			<xs:import schemaLocation="../../core_components/itintegration_registry_1.0.xsd"
				namespace="urn:riv:itintegration:registry:1" />
		</xs:schema>
	</wsdl:types>

	<wsdl:message name="RegisterMedicalCertificateRequest">
		<wsdl:part name="LogicalAddress" element="itr:LogicalAddress">
			<wsdl:documentation>
				LogicalAddress is the organization id for the insurance institution.
			</wsdl:documentation>
		</wsdl:part>
		<wsdl:part name="parameters" element="tjsr:RegisterMedicalCertificate" />
	</wsdl:message>

	<wsdl:message name="RegisterMedicalCertificateResponse">
		<wsdl:part name="parameters" element="tjsr:RegisterMedicalCertificateResponse" />
	</wsdl:message>

	<wsdl:portType name="RegisterMedicalCertificateResponderInterface">

		<wsdl:operation name="RegisterMedicalCertificate">
			<wsdl:input message="tns:RegisterMedicalCertificateRequest" />
			<wsdl:output message="tns:RegisterMedicalCertificateResponse" />
		</wsdl:operation>

	</wsdl:portType>

	<wsdl:binding name="RegisterMedicalCertificateResponderBinding"
		type="tns:RegisterMedicalCertificateResponderInterface">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />

		<wsdl:operation name="RegisterMedicalCertificate">
			<soap:operation
				soapAction="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1:RegisterMedicalCertificate"
				style="document" />
			<wsdl:input>
				<soap:header use="literal" message="tns:RegisterMedicalCertificateRequest"
					part="LogicalAddress" />
				<soap:body use="literal" parts="parameters" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>

	</wsdl:binding>

	<wsdl:service name="RegisterMedicalCertificateResponderService">
		<wsdl:port name="RegisterMedicalCertificateResponderPort"
			binding="tns:RegisterMedicalCertificateResponderBinding">
			<soap:address location="http://tempuri.org" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>