ServiceInteractions/bridgedinteractions/insuranceprocess/healthreporting/fk/trunk/RegisterMedicalCertificate/Test-consumer/untitled1.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="urn:riv:insuranceprocess:healthreporting:1"
    xmlns:ns2="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1"
    xmlns:ns3="http://www.w3.org/2005/08/addressing">
    <soapenv:Header>
        <ns3:To>FKTransform</ns3:To>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:RegisterMedicalCertificate>
            <ns2:lakarutlatande>
                <ns1:lakarutlatande-id>f31468a4-d99a-49ac-b86a-b7d0cc94eefb</ns1:lakarutlatande-id>
                <ns1:typAvUtlatande>Medicinskt underlag för bedömning av förmåga att arbeta vid
                    sjukdom</ns1:typAvUtlatande>
                <ns1:patient>
                    <ns1:person-id extension="199109192394" root="1.2.752.129.2.1.3.1"/>
                    <ns1:fornamn>Martin</ns1:fornamn>
                    <ns1:mellannamn/>
                    <ns1:efternamn>Bylund</ns1:efternamn>
                </ns1:patient>
                <ns1:skapadAvHosPersonal>
                    <ns1:personal-id extension="5656" root="1.2.752.129.2.1.4.1"/>
                    <ns1:fullstandigtNamn>Camilla Koch,</ns1:fullstandigtNamn>
                    <ns1:enhet>
                        <ns1:enhets-id extension="2275" root="1.2.752.129.2.1.4.1"/>
                        <ns1:enhetsnamn>1 /MED Enköp-T</ns1:enhetsnamn>
                        <ns1:postadress>hejsan svejsan gatan 1</ns1:postadress>
                        <ns1:postnummer>123 45</ns1:postnummer>
                        <ns1:postort/>
                        <ns1:telefonnummer>018-123456</ns1:telefonnummer>
                        <ns1:vardgivare>
                            <ns1:vardgivare-id extension="SE162321000024-0016208"
                                root="1.2.752.129.2.1.4.1"/>
                            <ns1:vardgivarnamn>Landstinget i Uppsala län</ns1:vardgivarnamn>
                        </ns1:vardgivare>
                    </ns1:enhet>
                </ns1:skapadAvHosPersonal>
                <ns1:vardkontakt>
                    <ns1:vardkontakttyp>Min_undersokning_av_patienten</ns1:vardkontakttyp>
                    <ns1:vardkontaktstid>2010-06-10+02:00</ns1:vardkontaktstid>
                </ns1:vardkontakt>
                <ns1:aktivitet>
                    <ns1:aktivitetskod>Avstangning_enligt_SmL_pga_smitta</ns1:aktivitetskod>
                </ns1:aktivitet>
                <ns1:aktivitet>
                    <ns1:aktivitetskod>Patienten_behover_fa_kontakt_med_Arbetsformedlingen</ns1:aktivitetskod>
                </ns1:aktivitet>
                <ns1:aktivitet>
                    <ns1:aktivitetskod>Planerad_eller_pagaende_behandling_eller_atgard_inom_sjukvarden</ns1:aktivitetskod>
                    <ns1:beskrivning>jkjkljklj</ns1:beskrivning>
                </ns1:aktivitet>
                <ns1:aktivitet>
                    <ns1:aktivitetskod>Arbetslivsinriktad_rehabilitering_ar_aktuell</ns1:aktivitetskod>
                </ns1:aktivitet>
                <ns1:aktivitet/>
                <ns1:aktivitet/>
                <ns1:bedomtTillstand>
                    <ns1:beskrivning>fjgjdfkgjkl</ns1:beskrivning>
                </ns1:bedomtTillstand>
                <ns1:medicinsktTillstand>
                    <ns1:beskrivning>fssdsdfhj</ns1:beskrivning>
                    <ns1:tillstandskod code="A12"/>
                </ns1:medicinsktTillstand>
                <ns1:funktionstillstand>
                    <ns1:beskrivning>gjfdgkjk</ns1:beskrivning>
                    <ns1:typAvFunktionstillstand>Kroppsfunktion</ns1:typAvFunktionstillstand>
                </ns1:funktionstillstand>
                <ns1:funktionstillstand>
                    <ns1:beskrivning>fgjdfgjlk</ns1:beskrivning>
                    <ns1:typAvFunktionstillstand>Aktivitet</ns1:typAvFunktionstillstand>
                    <ns1:arbetsformaga>
                        <ns1:motivering>gdfjgkdjklj</ns1:motivering>
                        <ns1:prognosangivelse>Aterstallas_helt</ns1:prognosangivelse>
                        <ns1:arbetsuppgift>
                            <ns1:typAvArbetsuppgift>jkjksfjsdj</ns1:typAvArbetsuppgift>
                        </ns1:arbetsuppgift>
                        <ns1:arbetsformagaNedsattning>
                            <ns1:varaktighetFrom>2010-06-06+02:00</ns1:varaktighetFrom>
                            <ns1:varaktighetTom>2010-06-10+02:00</ns1:varaktighetTom>
                            <ns1:nedsattningsgrad>Helt_nedsatt</ns1:nedsattningsgrad>
                        </ns1:arbetsformagaNedsattning>
                        <ns1:sysselsattning>
                            <ns1:typAvSysselsattning>Nuvarande_arbete</ns1:typAvSysselsattning>
                        </ns1:sysselsattning>
                        <ns1:sysselsattning>
                            <ns1:typAvSysselsattning>Arbetsloshet</ns1:typAvSysselsattning>
                        </ns1:sysselsattning>
                    </ns1:arbetsformaga>
                </ns1:funktionstillstand>
            </ns2:lakarutlatande>
        </ns2:RegisterMedicalCertificate>
    </soapenv:Body>
</soapenv:Envelope>
