ServiceInteractions/bridgedinteractions/insuranceprocess/healthreporting/fk/trunk/RegisterMedicalCertificate/Test-consumer/simple.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <ns3:To xmlns:ns3="http://www.w3.org/2005/08/addressing"
            xmlns:ns2="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1"
            xmlns="urn:riv:insuranceprocess:healthreporting:1">FKTransform</ns3:To>
    </soap:Header>
    <soap:Body>
        <ns2:RegisterMedicalCertificate xmlns="urn:riv:insuranceprocess:healthreporting:1"
            xmlns:ns2="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1"
            xmlns:ns3="http://www.w3.org/2005/08/addressing">
            <ns2:lakarutlatande>
                <lakarutlatande-id>ab4d3dc2-d493-4fb6-b59e-b870df2e7f80</lakarutlatande-id>
                <typAvUtlatande>Medicinskt underlag för bedömning av förmåga att arbeta vid
                    sjukdom</typAvUtlatande>
                <kommentar>Snabbt övergående förkylning.</kommentar>
                <signeringsdatum>2009-12-01T00:00:00.000+01:00</signeringsdatum>
                <skickatDatum>2010-05-31T10:46:17.704+02:00</skickatDatum>
                <patient>
                    <person-id extension="19430811-7094" root="1.2.752.129.2.1.3.1"/>
                    <fornamn>Mats</fornamn>
                    <efternamn>Testsson</efternamn>
                </patient>
                <skapadAvHosPersonal>
                    <personal-id extension="Personal HSA-ID" root="1.2.752.129.2.1.4.1"/>
                    <fullstandigtNamn>Erik Åselius</fullstandigtNamn>
                    <enhet>
                        <enhets-id extension="Enköpings lasaretts HSA-ID" root="1.2.752.129.2.1.4.1"/>
                        <arbetsplatskod extension="Arbetsplatskoden" root="1.2.752.29.4.71"/>
                        <enhetsnamn>Kir mott UAS/KIR</enhetsnamn>
                        <telefonnummer>018-611 45 30</telefonnummer>
                        <vardgivare>
                            <vardgivare-id extension="Uppsala landstings HSA-ID"
                                root="1.2.752.129.2.1.4.1"/>
                            <vardgivarnamn>Landstinget i Uppsala</vardgivarnamn>
                        </vardgivare>
                    </enhet>
                </skapadAvHosPersonal>
                <vardkontakt>
                    <vardkontakttyp>Min_undersokning_av_patienten</vardkontakttyp>
                    <vardkontaktstid>2009-12-01+01:00</vardkontaktstid>
                </vardkontakt>
                <aktivitet>
                    <aktivitetskod>Ovrigt</aktivitetskod>
                    <beskrivning>Näsdroppar x 4</beskrivning>
                </aktivitet>
                <aktivitet>
                    <aktivitetskod>Arbetslivsinriktad_rehabilitering_ar_ej_aktuell</aktivitetskod>
                </aktivitet>
                <aktivitet>
                    <aktivitetskod>Forandrat_ressatt_till_arbetsplatsen_ar_ej_aktuellt</aktivitetskod>
                </aktivitet>
                <bedomtTillstand>
                    <beskrivning>Förkylning, nästäppa, halsont</beskrivning>
                </bedomtTillstand>
                <medicinsktTillstand>
                    <beskrivning>Akut sinuit med biverkningar</beskrivning>
                    <tillstandskod codeSystemName="ICD-10" code="J01"/>
                </medicinsktTillstand>
                <funktionstillstand>
                    <beskrivning>Kraftig förtätning bihålor bilateralt</beskrivning>
                    <typAvFunktionstillstand>Kroppsfunktion</typAvFunktionstillstand>
                </funktionstillstand>
                <funktionstillstand>
                    <beskrivning>Bör avstå från att träffa andra människor då patienten är i ett
                        smittsamt stadium av sjukdomen.</beskrivning>
                    <typAvFunktionstillstand>Aktivitet</typAvFunktionstillstand>
                    <arbetsformaga>
                        <prognosangivelse>Aterstallas_helt</prognosangivelse>
                        <arbetsuppgift>
                            <typAvArbetsuppgift>Administrativa sysslor av journalsystem inom
                                landstinget</typAvArbetsuppgift>
                        </arbetsuppgift>
                        <arbetsformagaNedsattning>
                            <varaktighetFrom>2009-12-01+01:00</varaktighetFrom>
                            <varaktighetTom>2009-12-02+01:00</varaktighetTom>
                            <nedsattningsgrad>Helt_nedsatt</nedsattningsgrad>
                        </arbetsformagaNedsattning>
                        <sysselsattning>
                            <typAvSysselsattning>Nuvarande_arbete</typAvSysselsattning>
                        </sysselsattning>
                    </arbetsformaga>
                </funktionstillstand>
            </ns2:lakarutlatande>
        </ns2:RegisterMedicalCertificate>
    </soap:Body>
</soap:Envelope>
